#+AUTHOR: Andrew Lyjak
#+EMAIL: andrew.lyjak@gmail.com
#+OPTIONS: todo:nil
#+OPTIONS: toc:nil
#+OPTIONS: tags:nil
#+OPTIONS: prop:Effort
#+OPTIONS: ^:{}
#+STARTUP: indent
#+COLUMNS: %TODO %PRIORITY(P) %70ITEM(Task) %TAGS %8Effort(Estimated Effort){:} %DEADLINE
#+TAGS: h3d alyjak sow_1 sow_2 upkeep
#+PROPERTY: Effort_ALL 0 1:00 2:00 4:00 8:00 16:00 24:00 40:00 80:00

* TODO H3D SOW #1                                                 :h3d:sow_1:
The tasks and services agreed upon by the parties listed within the Consulting Agreement are
described herein. Work is divided into payment milestones, who's description and price is described
within the [[milestones][following table]]. Payment is expected upon completion of each milestone. The total
contract value, consisting of the sum of each milestone, is listed as the first line item of the
table. After notification by the consultant, *A Lyjak Cybernetics Consulting LLC*, the Client's
technical authority for the contract, *Jason Jaworski*, is responsible for affirming that all
sub-tasks enumerated within a milestone are confirmed satisfactorily complete. Evaluation is
expected within *10* business days of receiving notice of milestone completion. Payment is expected
within *one month* of an affirmative evaluation. It is the consultant's responsibility to respond
and incorporate feedback based on the technical authority's review before re-notifying the client of
milestone completion.


*Hourly Rate: $120/hr*

#+NAME: milestones
#+BEGIN: columnview :format "%ITEM(Task) %Effort(Effort){:} %Price(Price)" :hlines 2 :maxlevel 2
#+CAPTION: Estimated effort (HH:MM) and price for the SOW (row 1) and each sub-milestone therof
| Task                                       | Effort |    Price |
|--------------------------------------------+--------+----------|
| H3D SOW #1                                 | 207:00 | 24840.00 |
|--------------------------------------------+--------+----------|
| Detector QC Configuration and Verification |  27:00 |  3240.00 |
|--------------------------------------------+--------+----------|
| Extract Open Source Software from H3ID     |  88:00 | 10560.00 |
|--------------------------------------------+--------+----------|
| Capture Calibration Data and Store in H3ID |  68:00 |  8160.00 |
|--------------------------------------------+--------+----------|
| Golden Archive Rendered Template Override  |  16:00 |  1920.00 |
|--------------------------------------------+--------+----------|
| Update production server                   |   8:00 |   960.00 |
#+TBLFM: $3=$2*120;tE
#+END:
#+TBLFM: $3=$2*120;tE


** DONE Server Upgrade
:LOGBOOK:
CLOCK: [2023-06-07 Wed 14:04]--[2023-06-07 Wed 15:48] =>  1:44
CLOCK: [2023-06-07 Wed 10:36]--[2023-06-07 Wed 13:27] =>  2:51
CLOCK: [2023-06-07 Wed 07:43]--[2023-06-07 Wed 09:56] =>  2:13
CLOCK: [2023-06-06 Tue 12:37]--[2023-06-06 Tue 16:44] =>  4:07
CLOCK: [2023-06-05 Mon 10:54]--[2023-06-05 Mon 11:51] =>  0:57
CLOCK: [2023-06-05 Mon 07:34]--[2023-06-05 Mon 10:32] =>  2:58
CLOCK: [2023-06-05 Mon 05:53]--[2023-06-05 Mon 06:07] =>  0:14
CLOCK: [2023-06-05 Mon 05:30]--[2023-06-05 Mon 05:50] =>  0:20
CLOCK: [2023-06-04 Sun 05:27]--[2023-06-04 Sun 06:36] =>  1:09
CLOCK: [2023-06-03 Sat 05:32]--[2023-06-03 Sat 05:59] =>  0:27
CLOCK: [2023-06-02 Fri 14:31]--[2023-06-02 Fri 15:17] =>  0:46
CLOCK: [2023-06-02 Fri 07:35]--[2023-06-02 Fri 12:30] =>  4:55
:END:
- [X] Reset test to prod version and sync database
- [X] Debugged inability to access burner on prod. Root cause has something to do with redis. The
      client was unable to create a websocket connection. The server had a gunicorn_error related to not
      able to connect to redis. Restarted redis and was able to reconnect but the restart killed the
      workers. Restarted the workers and everything was back to normal.
- [X] Update test to model_schema branch and perform migration
- [X] Spot check everything is working
- [X] Fix tab anchor regression and related codemirror refresh issue
- [X] Remove `command` file from AsRun Logs
- [X] Fix config diff comparison. 'Detector' version isn't actually on the detector
- [X] Split update_unit into update_patch and update_config per discussion with Jason
- [X] Merge model_picker branch to master
- [X] Update prod to master and perform migration
- [X] Run h3id_client update to sync h3d model code schemas. Ran ~REQUESTS_CA_BUNDLE=/etc/ssl/certs/ca-certificates.crt h3id_client --host https://h3id.h3dgamma.com --user alyjak --pdb update --updates h3id/app/client/defaults.json -o build.model_code build.config_code spec.model_codes spec.model_schema spec.config_codes~
- [X] Send email to h3d
** DONE Tag up with Jason
:LOGBOOK:
CLOCK: [2023-06-06 Tue 11:01]--[2023-06-06 Tue 11:47] =>  0:46
CLOCK: [2023-06-08 Thu 16:01]--[2023-06-08 Thu 16:20] =>  0:19
:END:
** TODO Jason Call
:LOGBOOK:
CLOCK: [2023-07-11 Tue 07:14]--[2023-07-11 Tue 07:52] =>  0:38
CLOCK: [2023-07-06 Thu 14:38]--[2023-07-06 Thu 15:59] =>  1:21
CLOCK: [2023-07-06 Thu 13:18]--[2023-07-06 Thu 14:31] =>  1:13
CLOCK: [2023-06-13 Tue 14:12]--[2023-06-13 Tue 14:46] =>  0:34
:END:

2023-07-06: debugging why Jason wasn't seeing diffs after he modified templates for an H400. Looks
like the template mods he did were all whitespace in which case the diff wont appear as it
normalizes and auto formats between the versions in order to only show material changes.
** TODO 'Max' burn failing
:LOGBOOK:
CLOCK: [2023-06-14 Wed 08:41]--[2023-06-14 Wed 09:58] =>  1:17
:END:
Also fixed model code and option code not rendering on production build tab
also fixed `command` file not getting removed from asrun artifact zips
** TODO Chris SSU Boss unit creation incorrect ipv6 issue
:LOGBOOK:
CLOCK: [2023-06-26 Mon 09:00]--[2023-06-26 Mon 11:27] =>  2:27
CLOCK: [2023-06-26 Mon 08:27]--[2023-06-26 Mon 08:38] =>  0:11
:END:
also reviewed issue from Travis re M-00-01-220
and drafted a fix for a render bug for displaying unit model codes
** Burner not working
:LOGBOOK:
CLOCK: [2023-07-18 Tue 15:00]--[2023-07-18 Tue 15:24] =>  0:24
:END:

** TODO Add 'Unallocated' state to production status
:LOGBOOK:
CLOCK: [2023-08-29 Tue 12:15]--[2023-08-29 Tue 12:46] =>  0:31
CLOCK: [2023-08-17 Thu 12:03]--[2023-08-17 Thu 12:16] =>  0:13
CLOCK: [2023-08-16 Wed 13:44]--[2023-08-16 Wed 14:55] =>  1:11
CLOCK: [2023-08-16 Wed 11:28]--[2023-08-16 Wed 12:48] =>  1:20
:END:

** Reading RFP and generating questions/risks
:LOGBOOK:
CLOCK: [2023-06-13 Tue 15:35]--[2023-06-13 Tue 16:05] =>  0:30
CLOCK: [2023-06-13 Tue 14:19]--[2023-06-13 Tue 14:37] =>  0:18
CLOCK: [2023-06-13 Tue 13:30]--[2023-06-13 Tue 13:37] =>  0:07
CLOCK: [2023-06-13 Tue 13:16]--[2023-06-13 Tue 13:16] =>  0:00
CLOCK: [2023-06-02 Fri 13:46]--[2023-06-02 Fri 14:30] =>  0:44
:END:

** Reading DRD and generating Questions/Risks
:LOGBOOK:
CLOCK: [2023-06-09 Fri 13:35]--[2023-06-09 Fri 14:30] =>  0:55
CLOCK: [2023-06-09 Fri 11:25]--[2023-06-09 Fri 12:08] =>  0:43
CLOCK: [2023-06-09 Fri 10:28]--[2023-06-09 Fri 11:04] =>  0:36
CLOCK: [2023-06-09 Fri 09:39]--[2023-06-09 Fri 09:47] =>  0:08
CLOCK: [2023-06-05 Mon 13:40]--[2023-06-05 Mon 15:18] =>  1:38
:END:
- Reviewed LTV confluence pages

** Risk tag up
:LOGBOOK:
CLOCK: [2023-06-12 Mon 14:11]--[2023-06-12 Mon 14:53] =>  0:42
CLOCK: [2023-06-02 Fri 15:00]--[2023-06-02 Fri 16:10] =>  1:10
:END:

** Jesse Tag Up
:LOGBOOK:
CLOCK: [2023-06-05 Mon 12:17]--[2023-06-05 Mon 12:34] =>  0:17
:END:

- Zero code for LTV, Mission One. Intend to write starting after proposal is submitted and there's
  an SDP in place.
- SDP will be based on Odyssey's COTS+ version
- Venturi vs Astrolab: Venturi group is a conglomerate under one guy in Monaco. Astrolab is under
  this umbrella, only investor so far is this founder.
- subcontracting to other groups in the conglomerate for battery packs and tires
- Odyssey are full partners in the LTV proposal
- LTV proposal is primed by Astrolab, with Axiom and Odyssey as partners
- 'frenimies' with spacex, astrolab took some current employees
** Denise Tag Up
:LOGBOOK:
CLOCK: [2023-06-13 Tue 15:11]--[2023-06-13 Tue 15:34] =>  0:23
CLOCK: [2023-06-09 Fri 14:30]--[2023-06-09 Fri 15:13] =>  0:43
:END:

She's out until 6/7

I requested Denise's input on what I should work on. We'll talk again on Monday

Assuming responsibility for drafting TA.4

** Look for leverage points on control of NASA review subcontractors - June
:LOGBOOK:
CLOCK: [2023-06-28 Wed 15:32]--[2023-06-28 Wed 16:05] =>  0:33
CLOCK: [2023-06-13 Tue 12:29]--[2023-06-13 Tue 13:16] =>  0:47
:END:
** Look for leverage points on control of NASA review subcontractors - July
:LOGBOOK:
CLOCK: [2023-07-10 Mon 13:00]--[2023-07-10 Mon 16:49] =>  3:49
CLOCK: [2023-07-07 Fri 11:30]--[2023-07-07 Fri 15:42] =>  4:12
CLOCK: [2023-07-07 Fri 08:32]--[2023-07-07 Fri 10:20] =>  1:48
CLOCK: [2023-07-04 Tue 13:04]--[2023-07-04 Tue 13:38] =>  0:34
CLOCK: [2023-07-03 Mon 15:41]--[2023-07-03 Mon 16:44] =>  1:03
:END:
Talk to Julie Jiru to coordinate if there's a leverage point to gain insight and access to NASA
subcontract language for subcontractors who are responsible for insight and review activities.

Propsed we need a feedback mechanism such that:

- each rid has a notional cost to the submitter
- the goal is for the cost to be worth the reward
- can gamify this by having each rid have a submittal cost and the response provides a value

The problem is particularly bad for subcontractors, who are much more likely to act as
"disinterested observer" because of their disconnect with the actual program's objectives.

Introduce "RID Codes" That Astrolab assigns for each received RID. We have workflows for each
type. Program management has metrics associated with that assignment that flags working groups that
are breaking down.

There's a relationship between RIDs and Insight working group agenda's and NASA accountability. We
need to get this firm.

Currently Astrolab is responsible for each Insight Working Group Agenda.

out of each meeting
- attendance
- Astrolab's perceived value assessment, NASA's perceived value assessment

Each working group needs a:
- List of core members and their roles from NASA and Astrolab

----



Notes on Working Group Accountability process

Per working group we request that Astrolab and NASA independently track the following:

- The roles and names of their core team members
- Per a) DRD, b) Milestone Data Delivery, and c) Working Group Meeting

- Overall time spent and number of team members participating (preparing/reviewing)

- Per RID levied on the above: Program value categories (proposed categories are below)

----

# Proposal: A Feedback and Accountability Process for Certification Working Groups

Certification is an inherently adversarial process. Product owners endeavor to design and construct
a system capable of surpassing product success criteria whereas V&V criteria owners ensure the
intention of such criteria are satisfactorily met. Although this relationship is adversarial,
product owners and criteria owners are still partners; they simply approach the relationship between
product and evaluation criteria from different perspectives. Participation is aligned when both
partners are united by the overarching goal of ensuring program and operational success.

A well-run certification program is a positive sum proposition. The conflict between criteria and
product improves both the product, the criteria, and program itself. Nevertheless, the structure of
the certification process introduces opportunity for misalignment between the incentives of product,
criteria and program itself. As mission managers are the most likely parties to be aligned mission
success --- they are after all accountable for managing the program in order to achieve its
operational objectives --- they are least likely to experience misalignment between their role and
their personal incentives. As such, misalignment within the certification process can be adequately
controlled through the active participation of program management in assessing the performance
of each certification team. This in itself presents considerable difficulty as the reason to have
separate teams in the first place is due to the inherent complexity and domain expertise necessary
to evaluate the subsystems of any complex aerospace program. Therefore, mission management must
principally operate against aggregate and standardized information in order to assess whether more
direct intervention is necessary to resolve performance issues within a certification team.

To address the issue of certification misalignment, Astrolab proposes incorporation of the following
process for collecting and assessing metrics on the performance of all NASA-Astrolab certification
partnerships. This process is designed to fit easily into existing program workflows and helps to
ensure that certification responsible owners (product, certification criteria, as well as mission
management) stay accountable to the goals and constraints of the overarching Lunar Vehicle
Program. The proposal is as follows:

## Collection of Standardized Performance Metrics:

This proposal revolves around collecting and assessing metrics on the perceived value and effort
expended by product and criteria owners while performing their responsibilities with one another. By
aggregating metrics in a standard manner across each data product required for certification
purposes, the performance of each insight and certification working group team can be fairly
assessed and structural or personnel issues quickly brought to light in a fair and
non-discriminatory manner. Astrlab proposes that criteria and product teams each independently
annotate each certification collaboration item they bear responsibility for with the following information:

1. The value the item represents to the program. Proposed value ratings of:

  * -3: Subtracts significant value from the program
  * -2: Subtracts value from the program
  * -1: Subtracts insignificant value from the program
  *  0: Neither adds nor subtracts value away from the program
  * +1: Adds insignificant value to the program
  * +2: Adds value away to the program
  * +3: Adds significant value to the program

2. The number of hours the team spent in aggregate authoring, reviewing, revising, and/or responding
   to the item

We define certification collaboration items to encompass the following data products:

- DRD Deliverable
- Milestone Data Deliverable
- RID
- Working Group Agenda Item

In addition 
For each working group, the member's name, contact information, and responsibilities are
available. For each working group meeting, attendance is recorded.

Assessment of Performance


Perverse Incentives
- Regulatory Capture
- Intransigence
- Misalignment between product/criteria and Mission Success

Insufficient Expertise

Initiating Corrective Action due to Inadequate Performance

Arguments and Counterarguments:

Argument: Self-reported metrics, collected through surveys and the like, present an intrinsic
problem of data quality and consistency. Such metrics must be freely given in order to be of
sufficient quality to use, and most givers of such metrics have no personal incentive to offer them,
as their value is all captured in their aggregation and not the individual records.

Counterargument: In the proposal we can divide the personnel into three competing teams, each of
which is incentivized to provide accurate information in order to make their job easier. For
example, if criteria owners are given inadequate product data for their evaluation purposes, it will
take them longer to assess and the data sources they are provided with represent only marginal value
for their programmatic role. By accurately recording the effort the criteria team puts into review,
endemic issues with the pedagogical value of the underlying data source are exposed separately from
the day-to-day responsibility of identifying material issues (RIDS) in the performance of the
product for acheiving programmatic success. By expressing the value and effort the team perceives
for each deliverable, when inevetable conflicts between their adversarial partners arise, such as
when mission managers think the process is taking too long, or when product owners can't understand
why their results are not quickly accepted forthright, this assessment data protects the team by
adding quantitative rigor to their responsibilities in a way that can be fairly assessed in
comparison to the effort and value perceived by their counterparts.

** TA.2 Certification draft - July
:LOGBOOK:
CLOCK: [2023-07-07 Fri 07:42]--[2023-07-07 Fri 08:30] =>  0:48
:END:
** TA.2 Certification draft - June
:LOGBOOK:
CLOCK: [2023-06-30 Fri 08:11]--[2023-06-30 Fri 12:28] =>  4:17
CLOCK: [2023-06-29 Thu 14:54]--[2023-06-29 Thu 16:02] =>  1:08
CLOCK: [2023-06-29 Thu 12:55]--[2023-06-29 Thu 13:01] =>  0:06
CLOCK: [2023-06-28 Wed 11:38]--[2023-06-28 Wed 11:45] =>  0:07
CLOCK: [2023-06-28 Wed 10:17]--[2023-06-28 Wed 11:38] =>  1:21
CLOCK: [2023-06-28 Wed 07:56]--[2023-06-28 Wed 09:34] =>  1:38
CLOCK: [2023-06-27 Tue 14:30]--[2023-06-27 Tue 16:14] =>  1:44
CLOCK: [2023-06-27 Tue 11:24]--[2023-06-27 Tue 12:44] =>  1:20
CLOCK: [2023-06-15 Thu 13:12]--[2023-06-15 Thu 16:10] =>  2:58
CLOCK: [2023-06-12 Mon 14:53]--[2023-06-12 Mon 16:08] =>  1:15
CLOCK: [2023-06-12 Mon 13:47]--[2023-06-12 Mon 14:10] =>  0:23
CLOCK: [2023-06-09 Fri 15:30]--[2023-06-09 Fri 15:56] =>  0:26
CLOCK: [2023-06-09 Fri 07:41]--[2023-06-09 Fri 09:32] =>  1:51
CLOCK: [2023-06-09 Fri 05:52]--[2023-06-09 Fri 06:13] =>  0:21
CLOCK: [2023-06-09 Fri 05:37]--[2023-06-09 Fri 05:45] =>  0:08
CLOCK: [2023-06-08 Thu 15:20]--[2023-06-08 Thu 16:00] =>  0:40
:END:
Drafted text, need review and a bunch of diagrams. Likely a lot of this content belongs somewhere
else.

Make high level cert state machine diagram, and anatomy of a certification gate

review certification and milestones for consistency

Fixed up Lordina's rendering of the Anatomy of a Certification Gate Diagram

** TA.4 Review and Editing - June
:LOGBOOK:
CLOCK: [2023-06-29 Thu 13:07]--[2023-06-29 Thu 14:54] =>  1:47
CLOCK: [2023-06-14 Wed 13:41]--[2023-06-14 Wed 15:46] =>  2:05
CLOCK: [2023-06-14 Wed 11:46]--[2023-06-14 Wed 12:31] =>  0:45
CLOCK: [2023-06-14 Wed 10:00]--[2023-06-14 Wed 10:46] =>  0:46
CLOCK: [2023-06-14 Wed 08:14]--[2023-06-14 Wed 08:40] =>  0:26
CLOCK: [2023-06-14 Wed 07:26]--[2023-06-14 Wed 07:43] =>  0:17
CLOCK: [2023-06-14 Wed 05:59]--[2023-06-14 Wed 06:15] =>  0:16
:END:

Integration with milestones and (re)certificataion

Helping Bala with rationale behind standards adoption

** MA.2 Review and Editing - June
:LOGBOOK:
CLOCK: [2023-06-26 Mon 13:28]--[2023-06-26 Mon 15:04] =>  1:36
:END:
** Insight Task Basis of Estimate (BOE) Review - June
:LOGBOOK:
CLOCK: [2023-06-26 Mon 15:07]--[2023-06-26 Mon 15:51] =>  0:44
:END:

Ensure all insight related work is mapped to SMA BOE or Insight BOE and ensure the work is not
double-booked.

